"""
    核心数据类型
"""

"""
    空值对象 None
        表示不存在的特殊对象。
        作用：占位和解除与对象的关联。
"""
sex = None
a01 = "苏大强"
a01 = None

"""
    整型 int
        表示整数，包含正数、负数、0。
        如： -5, 100, 0
        字面值：
        十进制：5
        二进制：0b开头，后跟1或者1
        八进制：0o开头，后跟0~7
        十六进制：0x开头，后跟0~9， A~F，a~f
"""
num01 = 20
num02 = 0b10

"""
    浮点型 float
        表示小数，包含正数、负数，0.0)。
        字面值：
        小数：1.0 2.5
        科学计数法：e/E (正负号) 指数 （用于表示过小或过大的值很明确）
        1.23e-2 (等同于0.0123)
        1.23456e5(等同于123456.0)
"""

"""
    字符串 str
        是用来记录文本信息(文字信息)
        字面值：双引号或单引号
"""
str01 = "aaa"

"""
    由实部和虚部组成的数字。
        虚部是以j或J结尾。
        字面值： 1j   1+1j   1-1j
"""


"""
    布尔 bool
"""